Магазин_Гаджетонов/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПрав</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Включена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Магазин_Гаджетонов/src/Catalogs/Пользователи/ManagerModule.bsl
// Описание
// 
// Параметры:
// 	ТекПользователь - ПользовательИнформационнойБазы - 
// Возвращаемое значение:
// 	
Функция НайтиИлиСоздатьПользователя(ТекПользователь) Экспорт

	РезультатПоиска = НайтиПоНаименованию(ТекПользователь.Имя);

	Если (РезультатПоиска.Пустая()) Тогда

		НовыйПользователь = СоздатьЭлемент();
		НовыйПользователь.Наименование = ТекПользователь.Имя;
		НовыйПользователь.ПолноеИмя = ТекПользователь.ПолноеИмя;
		НовыйПользователь.Записать();

		РезультатПоиска = НовыйПользователь.Ссылка;
	КонецЕсли;

	Пользователь = РезультатПоиска.ПолучитьОбъект();
	Пользователь.ТаблицаПрав.Очистить();

	НаборПрав = Метаданные.Роли;

	Для Каждого Роль Из НаборПрав Цикл

		СтрокаТЧ = Пользователь.ТаблицаПрав.Добавить();
		СтрокаТЧ.ИмяРоли = Роль.Имя;
		СтрокаТЧ.Включена = ТекПользователь.Роли.Содержит(Роль);

	КонецЦикла;

	Пользователь.Записать();

	Возврат РезультатПоиска;

КонецФункции
